
public class Main {

	public static void main(String[] args) {
		/*
		 * 3월 20일(월) ~ 3월 26일(일) 회고록
		 * 
		 * 이번 주는 나에게 정말 어려운 시간이었고,
		 * 자신감 결여의 시간이었다.
		 * 
		 * Servlet을 이용한 데이터베이스 데이터 처리에 대한 수업, 과제를 하는데
		 * 어안이 벙벙하고 JDBC와 DB를 섞어 이것저것 해보는 시간이 참 어려웠다.
		 * 
		 * 그래서 멘탈도 부서지고, 스스로에 대한 책문을 하며
		 * 한계를 시험 받고 있었다고 생각한다.
		 * 
		 * 그래도 금,토,일 3일 동안 하라고 내 준 과제를
		 * 금요일 하루 수업 딱 끝나기 전, 완료해서...
		 * 정말 진심으로 눈물 날 뻔 했다.  
		 * 
		 * 물론 학원생들끼리 서로 조금의 도움은 받았지만,
		 * 지금 내가 진행하고 있는 방향이 맞는지의 확인 여부였을 뿐,
		 * 결코 그 외에 짓은 하지 않았다고 맹세한다.
		 * 
		 * 그렇기에 과제를 완료했을 때
		 * 말 못할 희열과 함께 뜨거운 눈물이 나올 뻔 했다.
		 * '그래도 세상이 나를 저버리진 않았구나' 라며 말이다.
		 * 
		 * 확실하게 이해한 것은 아니라고 생각했기 때문에
		 * 집에 와서 여러차례 코드를 뜯어보았다.
		 * 
		 * 개발자는 정말 재밌고 최고의 직업인 것 같다.
		 * 내 스스로가 열심히만 하면 가치가 올라가니 말이다!
		 * 물론 가치를 증명해야겠지만 말이다.
		 * 
		 * 오늘도 화이팅하자 !
		 * 
		 */
	}

}
